app/views/comments/_show.html.slim

SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = ?  [["post_id", 1]]
---
- @post.comments.each do |comment|
  .col-md-12 data-coment_id="#{comment.id}" data-post_id="#{@post.id}"