app/controllers/web/comments_controller.rb

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 3]]
INSERT INTO "comments" ("content", "post_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["content", "qweqw"], ["post_id", 3], ["user_id", 1], ["created_at", "2015-07-08 19:51:10.131287"], ["updated_at", "2015-07-08 19:51:10.131287"]]
---
  def create
    @post = Post.find(params[:post_id])
    comment = @post.comments.build(comment_params)
    comment.user = current_user

    if comment.save

DELETE FROM "comments" WHERE "comments"."id" = ?  [["id", 46]]
---
  def destroy
    @comment.delete