app/controllers/web/posts_controller.rb

  def index
    if params[:tag]
      @posts = Post.tagged_with(params[:tag]).paginate(:page => params[:page], :per_page => 3)
---
SELECT  "posts".* FROM "posts" JOIN taggings posts_taggings_9b6ef5a  ON posts_taggings_9b6ef5a.taggable_id = posts.id AND posts_taggings_9b6ef5a.taggable_type = 'Post' AND posts_taggings_9b6ef5a.tag_id = 1 LIMIT 3 OFFSET 0
SELECT COUNT(*) FROM "tags" JOIN (SELECT taggings.tag_id, COUNT(taggings.tag_id) AS tags_count FROM "taggings" INNER JOIN posts ON posts.id = taggings.taggable_id WHERE (taggings.taggable_type = 'Post' AND taggings.context = 'tags') AND (taggings.taggable_id IN(SELECT posts.id FROM "posts")) GROUP BY taggings.tag_id HAVING COUNT(taggings.tag_id) > 0) AS taggings ON taggings.tag_id = tags.id
SELECT COUNT(count_column) FROM (SELECT  1 AS count_column FROM "posts" LIMIT 1 OFFSET 0) subquery_for_count
SELECT tags.*, taggings.tags_count AS count FROM "tags" JOIN (SELECT taggings.tag_id, COUNT(taggings.tag_id) AS tags_count FROM "taggings" INNER JOIN posts ON posts.id = taggings.taggable_id WHERE (taggings.taggable_type = 'Post' AND taggings.context = 'tags') AND (taggings.taggable_id IN(SELECT posts.id FROM "posts")) GROUP BY taggings.tag_id HAVING COUNT(taggings.tag_id) > 0) AS taggings ON taggings.tag_id = tags.id

  def create
    @post = current_user.posts.create(post_params)
---
INSERT INTO "posts" ("title", "content", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "wefew"], ["content", "<p>ewfew</p>\r\n"], ["user_id", 1], ["created_at", "2015-07-08 19:51:21.130819"], ["updated_at", "2015-07-08 19:51:21.130819"]]

  def update
    respond_to do |format|
      if @post.update(post_params)
---
UPDATE "posts" SET "updated_at" = ? WHERE "posts"."id" = ?  [["updated_at", "2015-07-15 19:46:56.276338"], ["id", 7]]