app/views/web/posts/index.html.slim

      p.pull-right
        span = post.tag_list.map { |t| link_to t, tag_path(t), class: 'label label-default' }.join(" ").html_safe
---
SELECT "tags".* FROM "tags" WHERE (LOWER(name) = LOWER('tags'))

          li
            i.glyphicon.glyphicon-comment  #{post.comments.count}  Comments
---
SELECT COUNT(*) FROM "comments" WHERE "comments"."post_id" = ?  [["post_id", 3]]