app/views/web/comments/_show.html.slim

- @post.comments.each do |comment|
  .col-md-12 data-coment_id="#{comment.id}" data-post_id="#{@post.id}"
---
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = ?  [["post_id", 3]]