app/views/posts/index.html.slim

          li
            i.glyphicon.glyphicon-comment  #{post.comments.count}  Comments
---
SELECT COUNT(*) FROM "comments" WHERE "comments"."post_id" = ?  [["post_id", 1]]