app/controllers/comments_controller.rb

  def create
    @post = Post.find(params[:post_id])
    comment = @post.comments.build(comment_params)
    comment.user = current_user

    if comment.save
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 4]]
INSERT INTO "comments" ("content", "post_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["content", "fggf"], ["post_id", 1], ["user_id", 2], ["created_at", "2015-04-26 09:27:31.508162"], ["updated_at", "2015-04-26 09:27:31.508162"]]

  def destroy
    @post = @comment.post
    @comment.delete
---
DELETE FROM "comments" WHERE "comments"."id" = ?  [["id", 1]]