app/controllers/posts_controller.rb

  def create
    @post = current_user.posts.create(post_params)
---
INSERT INTO "posts" ("title", "content", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "Title"], ["content", "Content"], ["user_id", 1], ["created_at", "2015-04-18 21:39:40.233081"], ["updated_at", "2015-04-18 21:39:40.233081"]]